In [43]:
import xlrd
import pandas as pd
sample_1=pd.read_excel('C:/Users/user1/Desktop/datasalon-master/01_초판/2_Start_DataAnalysis/files/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C')
sample_1.head(3) # head(n)앞에서 부터 n가지 로우

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [45]:
import xlrd
import pandas as pd
sample_1=pd.read_excel('C:/Users/user1/Desktop/datasalon-master/01_초판/2_Start_DataAnalysis/files/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C')
sample_1.tail(3) #tail(n)뒤에서 부터 n가지 로우

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [46]:
import xlrd
import pandas as pd
sample_1=pd.read_excel('C:/Users/user1/Desktop/datasalon-master/01_초판/2_Start_DataAnalysis/files/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C')
sample_1.info()  # 불러온 내용 정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [47]:
import xlrd
import pandas as pd
sample_1=pd.read_excel('C:/Users/user1/Desktop/datasalon-master/01_초판/2_Start_DataAnalysis/files/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C')
sample_1.describe() # 데이터의 갯수, 평균값, 표준편차, 최솟값, 1사분위수, 2사분위수, 3사분위수, 최대값

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [48]:
sample_1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [49]:
sample_1['입국객수']

0    106320
1    191436
2       319
3        42
4    158912
5    232943
Name: 입국객수, dtype: int64

In [53]:
sample_1[['국적코드','입국객수']] #[]안에다 []형태로 묶어야함

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [54]:
sample_1['기준년월']='2019-11' #칼럼 생성
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [56]:
condition=(sample_1['성별']=='남성') #로우 기준으로 필터링 
condition

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [57]:
sample_1[condition] #필터링 후 결과

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [58]:
condition=(sample_1['입국객수']>=150000)
sample_1[condition]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [60]:
conditions=(sample_1['성별']=='남성')&(sample_1['입국객수']>=150000) #두 가지 모두 필터링 conditions != condition
conditions

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [61]:
sample_1[conditions]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11